{
  "blogs": [
    {
      "id": "1",
      "title": "Neurodiversity and Safety - Creating Inclusive Workplaces for Diverse Thinkers",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog1.jpg",
      "description": "Neurodiversity and Safety - Creating Inclusive Workplaces for Diverse Thinkers",
      "header": "Neurodiversity and Safety - Creating Inclusive Workplaces for Diverse Thinkers",
      "bodyText": "<p>In the ever-evolving landscape of workplace culture, the inclusion of neurodivergent individuals is emerging as a cornerstone for innovation and safety. The latest episode of Neurodivergent Mates podcast features Catherine Lee, a seasoned expert in occupational health and safety with a particular focus on the neurodivergent community. Throughout the episode, we traverse the multifaceted world of neurodiversity in the workplace, illuminating the need for environments that not only acknowledge but also celebrate cognitive differences.</p><p>Catherine's journey began with a strong foundation in nursing, a career path rooted in care and prevention. Her transition into occupational health was fueled by the desire to mitigate workplace injuries and cultivate employee well-being. This commitment led to her consultancy work at the executive level, where she champions the integration of safety protocols and the promotion of health in corporate strategies. Particularly intriguing is her ongoing research on ADHD within the aviation industry, a critical look at how neurodivergence affects safety-sensitive roles.</p><p>The discussion takes a personal turn as we hear stories that reveal the profound impact neurodiversity has on daily operations and the well-being of employees. A mother's concern for her autistic and epileptic daughter's workplace safety serves as a powerful testament to the urgent need for inclusive policies. The episode also features a harrowing account of an ADHD colleague's accident, shedding light on the lack of support for neurodivergent individuals in traditional workplace structures. These narratives underscore the necessity of tailored communication and health and safety measures that consider the unique needs of each employee.</p><p>As the conversation unfolds, we are reminded that neurodivergence is not an anomaly; it's estimated that one in ten workers is neurodivergent. This prevalence calls for a reevaluation of standard workplace practices and a pivot towards a more person-centered, strength-based approach. Employers bear the responsibility of crafting safe spaces that not only prevent discrimination but also empower neurodivergent workers to thrive. The episode discusses how person-centered approaches, like in the case of an autistic worker's aversion to full-face masks, can lead to better safety outcomes than disciplinary actions.</p><p>In a particularly enlightening segment, the podcast explores the intersection of neurodiversity and technology. The use of alternative communication methods, such as video blogs, caters to the diverse learning styles present in the workforce. This adaptability not only aligns with safety regulations but also enriches employee engagement. While there is resistance to non-traditional communication methods, Catherine emphasizes the potential of AI to further tailor workplace safety practices.</p><p>The final chapters of the podcast touch on the power of leveraging the unique perspectives of neurodivergent individuals. It's not just about compliance with legal standards; it's about understanding that neurodiversity can drive innovation and efficiency. Through anecdotes and strategies, Catherine Lee paints a vivid picture of a workplace where neurodivergent talents are not just included but nurtured for the collective benefit of the organization.</p><p>In closing, the episode does more than just spotlight the challenges faced by neurodivergent workers; it offers tangible solutions and calls for action. The Neurodivergent Mates podcast invites listeners to join the conversation, encouraging a shift in mindset towards a future where workplace safety and inclusivity are synonymous. Catherine Lee's insights provide a beacon for employers and employees alike, advocating for a world where every mind is valued, and every workplace is a sanctuary of support and growth.</p>",
      "scriptSrc": "https://www.buzzsprout.com/2132579/14760813-neurodiversity-and-safety-creating-inclusive-workplaces-for-diverse-thinkers-catherine-lee.js?container_id=buzzsprout-player-14760813&player=small",
      "containerId": "buzzsprout-player-14760813",
      "keywords": "Neurodivergent Inclusion, Workplace Culture, Innovation, Safety, Occupational Health, Cognitive Differences, ADHD, Autism, Epilepsy, Inclusive Policies, Person-Centered, Strength-Based, Communication, Technology, AI, Employee Engagement, Legal Standards, Innovation, Efficiency, Workplace Safety"
    },
    {
      "id": "2",
      "title": "Navigating Academia as a Neurodivergent Individual",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog2.jpg",
      "description": "Navigating Academia as a Neurodivergent Individual",
      "header": "Navigating Academia as a Neurodivergent Individual",
      "bodyText": "<p>Navigating the academic world can be a complex journey for neurodivergent individuals, and Sol Willan's story offers a unique and resonant perspective. In a recent episode of NeuroDivergent Mates, Sol delves into the intricacies of life before and after receiving a neurodivergence diagnosis, providing listeners with a rich tapestry of experiences that highlight both the challenges and triumphs faced by those who are neurodivergent.</p><p>The podcast illuminates the realities of higher education for neurodivergent students, addressing the nuances of disability services on campuses. It prompts a re-examination of what it means to be disabled and the importance of fostering a learning environment that celebrates diverse intellectual patterns. This conversation goes beyond personal narratives to encompass the collective plea for a more inclusive academic space, touching on topics such as imposter syndrome and the diverse environmental factors that impact students' educational experiences.</p><p>One of the most compelling aspects of the episode is the strategic insights provided on how educational institutions can evolve to better support neurodivergent students. The episode emphasizes the potential of assistive technology, the importance of early intervention, and the transformative power of tailored support. The discussion advocates for proactive strategies that focus on empowering students from the outset rather than reacting to challenges as they arise.</p><p>Furthermore, the episode highlights the complex relationship that neurodivergent individuals have with the term 'disability.' Sol shares their journey of navigating their identity, adding depth to the conversation about evolving perceptions within younger generations. The importance of not requiring visible proof of someone's disability to offer support is also examined, advocating for a more inclusive approach to student services.</p><p>The impact of non-supportive environments, sensory overstimulation, and societal expectations are dissected, emphasizing the need for a supportive educational infrastructure. Personal experiences with ADHD and autism are shared, discussing how these conditions can be both disabling in certain contexts and integral to one's identity, influencing creativity and thought processes.</p><p>As the episode draws to a close, it reflects on the encounter with the younger generation and the reassurance that they will receive the support they need. This heartening exchange not only enlightens but also champions the empowerment of every neurodivergent individual in academia. It serves as a call to action for institutions and individuals alike to contribute to a more inclusive and understanding future in education.</p><p>In essence, the episode serves as a beacon of hope and a source of practical guidance for those within the neurodivergent community and for the educators and institutions that have the capacity to make a meaningful difference in the academic experience of neurodivergent students. The podcast episode, rich in personal anecdotes and insightful dialogue, stands as an essential resource for anyone interested in the intersection of neurodiversity and education.</p>",
      "scriptSrc": "https://www.buzzsprout.com/2132579/15057876-navigating-academia-as-a-neurodivergent-individual-sol-willian-s-journey-and-the-push-for-inclusive-education.js?container_id=buzzsprout-player-15057876&player=small",
      "containerId": "buzzsprout-player-15057876",
      "keywords": "Neurodivergent Individuals, Academic Journey, Neurodivergence Diagnosis, Disability Services, Inclusive Academic Space, Imposter Syndrome, Assistive Technology, Tailored Support, Identity Navigation, Supportive Educational Infrastructure, ADHD, Autism, Sensory Overstimulation, Societal Expectations, Empowerment, Inclusive Approach, Personal Experiences, Academic Experience, Neurodiversity, Education"
    },
    {
      "id": "3",
      "title": "Navigating life as a neurodivergent individual",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog3.jpg",
      "description": "Navigating life as a neurodivergent individual",
      "header": "Navigating life as a neurodivergent individual",
      "bodyText": "<p>Navigating life as a neurodivergent individual comes with unique challenges and triumphs, more so when the virtual world becomes a significant part of one's identity. The latest podcast episode featuring Brie Mills, a neurodivergent content creator, provides a deep dive into the experiences of those who live at the intersection of neurodiversity and digital existence. This conversation sheds light on how individuals like Brie manage to maintain their authentic selves in online spaces that often demand curated personas.</p><p>For many neurodivergent individuals, the internet can be both a sanctuary and a battleground. It offers a platform where they can express themselves and find community without the overwhelming sensory input of the physical world. Brie's story is a testament to the power of online spaces in allowing neurodivergent individuals to craft their identities and build connections on their own terms. Her viral success with meme-based content speaks to the relatability and reach that authenticity can have online.</p><p>However, managing online personas also requires a delicate balance between authenticity and the strategic presentation of the self. Brie discusses the complexities of this balance, highlighting the importance of staying true to one's values and interests while also engaging with the audience in a meaningful way. She shares her strategies for community building, which include tailoring content to specific platforms and demographics, and the need to maintain a consistent and genuine online presence.</p><p>Another aspect that the episode delves into is the concept of radical authenticity. This is about being true to oneself at a core level, beyond simply matching one's outward claims to their inner truths. The hosts, including Brie, open up about their personal journeys of self-discovery and the liberating effect of embracing their neurodivergent traits. They share stories of overcoming challenges such as alcoholism and depression, and how recognizing and owning their unique experiences has led to more authentic relationships and interactions.</p><p>Dealing with the less pleasant side of online interactions, such as trolls, is also a part of the neurodivergent online experience. Brie talks about her approach to handling negative comments with humor and how it can unexpectedly boost engagement. The episode touches on the fine line between being genuine online and respecting others' boundaries. The concept of radical authenticity does not excuse poor behavior, and there is an emphasis on self-awareness and taking responsibility for one's actions.</p><p>As the conversation progresses, it explores the impact of authenticity and accountability within the neurodivergent community. It highlights the importance of kindness and owning up to mistakes, without hiding behind neurodivergence as an excuse. Furthermore, the discussion addresses the difficulties of engaging in online debates and how disengaging can sometimes be the healthiest option. Brie shares an anecdote about a difficult political conversation and the value of maintaining friendships despite differences in opinion.</p><p>Finally, the episode wraps up with insights on how radical authenticity can benefit business practices. Brie talks about aligning with partnerships that resonate with one's brand values and the long-term benefits of building trust through authenticity. The podcast concludes with reflections on neurodiversity and personal growth, with Brie sharing her experiences in education and the workplace. It celebrates the growth of the podcast and the connections made with international guests who bring diverse perspectives to these important discussions.</p><p>This episode stands as a celebration of the neurodivergent community and the unique ways in which they navigate online spaces. It serves as a reminder that, amidst the complexities of digital identities, there is a profound strength in being unabashedly and unapologetically onese</p>",
      "scriptSrc": "https://www.buzzsprout.com/2132579/15006167-radical-authenticity-with-bree-mills-readysetsquirrel.js?container_id=buzzsprout-player-15006167&player=small",
      "containerId": "buzzsprout-player-15006167",
      "keywords": "Neurodivergent Individuals, Digital Existence, Online Spaces, Authenticity, Content Creation, Community Building, Radical Authenticity, Self-Discovery, Online Interactions, Trolls, Self-Awareness, Accountability, Online Debates, Business Practices, Partnerships, Brand Values, Personal Growth, Podcast Episode, Neurodiversity, Digital Identities"
    },
      {
      "id": "4",
      "title": "Mastering Data Science with Dyslexia",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog4.jpg",
      "description": "Mastering Data Science with Dyslexia",
      "header": "Mastering Data Science with Dyslexia",
      "bodyText": "<p>The intersection of dyslexia and data science may not seem apparent at first glance, yet Nicholas Letchford's story reveals a profound connection between the two. In our recent podcast episode, Nicholas, a mathematical mastermind and health economics consultant, shares his journey through the meticulous world of data science as a dyslexic individual.</p><p>Nicholas's narrative is one that resonates with many in the neurodiverse community. He speaks about the unique challenges he faces, such as difficulties with verbal communication of complex ideas, particularly in professional settings. This, however, is counterbalanced by his ability to see solutions through visualization—a strength that dyslexia often imparts.</p><p>Listeners are given an intimate look into the intricate process of simplifying complex predictive models for diverse audiences, an essential skill in Nicholas's field, especially during public health crises like the COVID-19 pandemic. The episode illuminates the delicate balance required between making data accessible and maintaining scientific integrity when informing crucial policy decisions.</p><p>Another crucial aspect that Nicholas discusses is the tension between his slower, more thoughtful processing speed and the rapid response often expected in professional environments. His personal anecdotes provide insight into how dyslexic individuals might navigate high-stakes scenarios where immediate communication is crucial.</p><p>Moreover, Nicholas's journey is a testament to resilience. He shares his experiences of leveraging assistive technologies, like text-to-speech, to aid in reading comprehension—a common hurdle for those with dyslexia. He also reflects on the transformative power of nurturing supportive mentorships and educational environments that understand and embrace learning differences.</p><p>Through his story, we gain a greater appreciation for the diverse intellects enriching the data science landscape. Nicholas's ability to transform what some may see as obstacles into professional strengths is not only inspiring but also a call to action for more inclusive practices within educational and professional spheres.</p><p>This episode serves as an invaluable resource for anyone with learning differences, as well as the communities that support them. It is a powerful reminder that the path to success is not a one-size-fits-all journey and that embracing neurodiversity can lead to unexpected and innovative solutions in the world of data science and beyond.</p><p>Nicholas's insights into the world of data science from a neurodiverse perspective highlight the importance of adaptability, understanding, and clarity—key components in navigating the complex realm of data and analytics. His story encourages us to look beyond conventional thinking and to value the unique contributions of all individuals, particularly those with dyslexia, in shaping the future of technology and research.</p>",
      "scriptSrc": "https://www.buzzsprout.com/2132579/14847901-mastering-data-science-with-dyslexia-insights-from-nicholas-letchford-s-journey.js?container_id=buzzsprout-player-14847901&player=small",
      "containerId": "buzzsprout-player-14847901",
      "keywords": "Dyslexia, Data Science, Neurodiverse Community, Professional Settings, Visual Communication, Predictive Models, Accessibility of Data, Policy Decisions, Processing Speed, Assistive Technologies, Supportive Mentorships, Learning Differences, Inclusive Practices, Educational Environments, Resilience, Professional Strengths, Diversity of Intellects, Inclusive Practices, Neurodiversity, Data and Analytics"
    },
    {
      "id": "5",
      "title": "Building Community Through Authentic Connection NDM Blog",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog5.svg",
      "description": "Building Community Through Authentic Connection NDM Blog",
      "header": "Building Community Through Authentic Connection NDM Blog",
      "bodyText": "<p>In a world that often seeks conformity, embracing neurodiversity stands as a testament to the beauty and richness of human variation. Neurodiversity encompasses a range of neurological differences, including autism, ADHD, dyslexia, and more. Rather than viewing these differences as deficits, the neurodiversity movement celebrates them as unique expressions of human cognition and experience. At the heart of this movement lies the importance of building a community grounded in authentic connection.</p><p>Authentic connection serves as the cornerstone of any meaningful community. It transcends surface-level interactions and delves into the depths of genuine understanding and empathy. For individuals with neurodiverse traits, authentic connection can be especially transformative. It provides a safe space where they can be their true selves without fear of judgment or rejection.</p><p>One of the key benefits of building a neurodiversity community based on authentic connection is the sense of belonging it fosters. All too often, individuals with neurodiverse traits experience feelings of isolation and alienation due to their differences. By coming together in a supportive community, they find validation and acceptance among peers who share similar experiences.</p><p>Moreover, authentic connection facilitates the exchange of experiences, resources, and support within the neurodiversity community. Through open and honest dialogue, individuals can learn from one another, gain valuable insights, and access the tools they need to navigate the challenges they face. Whether it's sharing coping strategies for sensory sensitivities or recommending accommodations in the workplace, the collective wisdom of the community is a powerful resource.</p><p>In addition to practical support, authentic connection also plays a crucial role in challenging stigma and misconceptions surrounding neurodiversity. By sharing their stories and advocating for acceptance, members of the community can educate others and promote greater understanding and inclusivity. Through empathy and compassion, they break down barriers and pave the way for a more equitable society.</p><p>Authentic connection is not just about what we say, but also how we listen. Active listening is a fundamental skill that fosters deeper understanding and empathy. By truly listening to the experiences and perspectives of neurodiverse individuals, we validate their lived realities and honor the diversity of human experience. In doing so, we cultivate a culture of mutual respect and appreciation within the community.</p><p>Furthermore, authentic connection promotes self-discovery and personal growth. In an environment where individuals are free to express themselves authentically, they are empowered to explore their strengths, passions, and interests without fear of judgment. By embracing their neurodiverse traits as integral aspects of their identity, they can harness their unique talents and contributions to make a positive impact on the world.</p><p>Building a neurodiversity community grounded in authentic connection requires intentional effort and commitment. It begins with creating safe and inclusive spaces where individuals feel valued and respected for who they are. This may involve establishing support groups, organizing events, or fostering online communities where people can connect and share their experiences.</p><p>Additionally, it's essential to prioritize accessibility and accommodation to ensure that all members of the community can participate fully. This may include providing sensory-friendly environments, offering alternative communication methods, or implementing flexible scheduling options. By removing barriers to participation, we ensure that everyone has the opportunity to contribute and thrive.</p><p>Ultimately, embracing neurodiversity and building a community through authentic connection enriches us all. It challenges us to expand our understanding of what it means to be human and invites us to celebrate the beauty of our differences. By coming together in solidarity and support, we create a world where everyone is valued, accepted, and empowered to reach their full potential.</p>",
      "scriptSrc": "",
      "containerId": "",
      "keywords": "Neurodiversity, Authentic Connection, Community, Acceptance, Inclusivity, Empathy, Support, Understanding, Stigma, Diversity, Identity, Advocacy, Empowerment, Listening, Respect"
    },
    {
      "id": "6",
      "title": "Approach to Eating Disorders and Inclusive Sports Programs",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog6.jpg",
      "description": "Approach to Eating Disorders and Inclusive Sports Programs",
      "header": "Approach to Eating Disorders and Inclusive Sports Programs",
      "bodyText": "<p>Navigating life's hurdles can be a solitary journey for many, but for those who are neurodivergent and battling eating disorders, the path is often a convoluted dance of self-discovery and societal understanding. The recent podcast episode featuring Lindsay Keating provides a deeply personal and insightful look into the intricacies of living with neurodiversity and the additional layer of complexity that eating disorders bring.</p><p>Lindsay's story is not uncommon; developmental delays and conditions such as autism often go undiagnosed or misunderstood, particularly in females. Her narrative sheds light on the subtle cues and nuances that can signify a neurodivergent mind. From the hereditary aspects to the social misinterpretations, Lindsay's experience highlights the need for greater awareness and empathy within our communities and medical systems.</p><p>As a beacon of support and advocacy, Lindsay has channeled her experiences into creating Nature Moves and Spectrum Sports—initiatives that offer inclusive outdoor experiences and sports programs for autistic children. These programs emphasize the need for flexible attendance and sensory-friendly environments, ensuring that children on the spectrum have opportunities to engage in physical activities that are tailored to their unique needs.</p><p>Moreover, Lindsay's discussion on eating disorders, particularly anorexia, is a poignant reminder of the complexities surrounding this mental health challenge. The podcast dives into the triathlete's battle with anorexia, exploring the intense fixation on control and calorie counting. It is a candid examination of how restrictive eating can manifest as an attempt to manage life's uncertainties and pressures.</p><p>The societal stigma attached to both neurodivergence and eating disorders further complicates the journey towards recovery and acceptance. Lindsay's conversation touches on the impact of body image misconceptions, the strongman community's battle with these ideals, and the tragic consequences that can arise from such disorders. This episode is a clarion call for open dialogue, shedding light on the diverse experiences and often misunderstood paths of those struggling with these conditions.</p><p>As the episode concludes, Lindsay and the hosts, Will Wheeler and Photon John Kev, emphasize the importance of family dynamics and relationships in the recovery process. They advocate for non-critical support and open communication, especially for neurodivergent individuals who may be more sensitive to criticism and isolation. Understanding and empathy are underscored as vital components in supporting someone through an eating disorder, particularly when considering the possibility of neurodivergence.</p><p>The conversation with Lindsay Keating is more than just an episode; it is a powerful reminder of the resilience and diverse tapestry of experiences within the neurodivergent community. Her mission to foster inclusive athletic and nutritional healing is a testament to the positive impact that understanding and tailored community programs can have. This episode not only champions the beauty of differences but also the significance of forging understanding and support within families and communities. It is an invitation to embrace neurodiversity and become advocates for change in our own spheres of influence.</p><p>In summary, this episode provides a compelling and comprehensive examination of the intersection of neurodiversity and eating disorders. It serves as a critical resource for anyone looking to understand the challenges faced by the neurodivergent community and the pathways to healing and support through inclusive sports and community engagement.</p>",
      "scriptSrc": "https://www.buzzsprout.com/2132579/14931845-embracing-neurodiversity-lindsay-keating-s-approach-to-eating-disorders-and-inclusive-sports-programs.js?container_id=buzzsprout-player-14931845&player=small",
      "containerId": "buzzsprout-player-14931845",
      "keywords": "Neurodivergent, Eating Disorders, Autism, Awareness, Empathy, Support, Advocacy, Inclusivity, Community, Resilience, Family Dynamics, Sensory-friendly, Mental Health, Recovery, Body Image"
    },
    {
      "id": "7",
      "title": "Stepping Outside of Your Comfort Zone - Pros, Cons & Tips",
      "imageUrl": "https://neurostudyportal.s3.ap-southeast-2.amazonaws.com/blogs/images/blog7.svg",
      "description": "Stepping Outside of Your Comfort Zone - Pros, Cons & Tips",
      "header": "Stepping Outside of Your Comfort Zone - Pros, Cons & Tips",
      "bodyText": "<p>Understanding the nuances of the neurodivergent mind is akin to embarking on a journey through a landscape rich with varying terrains, each with its own unique set of challenges and beauty. In our recent podcast episode, we sat down to unravel the complexities of living and thriving with ADHD and beyond. The conversation was an enlightening exploration of personal and professional growth, viewed through the lens of neurodiversity.</p><p>Neurodivergent individuals often navigate a world that's not tailored to their unique way of processing information. For instance, routines that seem mundane to some can pose significant challenges to those with ADHD. It's not merely about adjusting to the societal norms but finding a harmonious balance that honors one's intrinsic needs while still allowing for personal evolution. During the podcast we shed light on the importance of self-acceptance and the delicate act of stepping outside one's comfort zone to discover and harness unexpected talents.</p><p>The journey of a neurodivergent entrepreneur is not a linear path, but one filled with unseen victories that often go unnoticed by the outside world. Our discussion ventured into the realm of entrepreneurship, where traditional networking and investment strategies can seem like foreign concepts. Yet, by nurturing authenticity and aligning with like-minded individuals, neurodivergent entrepreneurs can carve out spaces where profitability and social impact coalesce. This narrative emphasizes the power of community and the strength found in embracing one's neurodiversity as an asset rather than a hindrance.</p><p>In celebrating the 50th episode of our podcast coming up, we also delved into the more subtle aspects of neurodivergent lives, such as volunteering and advocating for sensory-friendly environments. Photon John Kev recounted personal experiences, illustrating how volunteering opened doors to new connections and community support. He highlighted the transformative power of stepping into unfamiliar territories, not just for personal gain but for the enrichment of society at large.</p><p>Creating supportive environments for neurodivergent individuals is an ongoing dialogue between personal advocacy and societal education. The episode underscored the need for spaces that accommodate sensory preferences and the critical role of friends and family in understanding and supporting these needs. As neurodivergent individuals unmask and navigate social situations, the conversation turned towards the importance of unapologetically prioritizing one's well-being.</p><p>As we continue to champion the neurodivergent experience, it's vital to have open conversations that foster inclusivity. Our podcast serves as a platform to amplify the voices of those who might otherwise go unheard, and to illuminate the multifaceted experiences of neurodivergent individuals. By sharing these stories, we hope to pave the way for a more empathetic and understanding society.</p><p>In conclusion, the latest episode of our podcast is a heartfelt tribute to the neurodivergent community, offering a window into the lives of those who see the world differently. We invite listeners to immerse themselves in the rich tapestry of neurodiversity and to join us in celebrating the unique strengths and contributions of every individual on the spectrum.</p>",
      "scriptSrc": "https://www.buzzsprout.com/2132579/15141936-stepping-outside-of-your-comfort-zone-pros-cons-tips.js?container_id=buzzsprout-player-15141936&player=small",
      "containerId": "buzzsprout-player-15141936",
      "keywords": "Neurodivergent, ADHD, Entrepreneurship, Self-acceptance, Community, Sensory-friendly, Volunteering, Advocacy, Personal growth, Authenticity, Social impact, Supportive environments, Well-being"
    }
  ]
}
